; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v4 - type_1 ?v7 - type_3)
 	      (pred_3 ?v8 - object ?v7 - type_3)
	      (pred_2 ?v4 - type_1 ?v3 - type_2)
	      (pred_1 ?v4 - type_1 ?v8 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v4 - type_1 ?v1 ?v2 - type_3)
       :precondition (and  (pred_4 ?v4 ?v1))
       :effect (and  (pred_4 ?v4 ?v2)
		     (not (pred_4 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_1 ?v6 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v5) (pred_4 ?v4 ?v5) (pred_2 ?v4 ?v3))
       :effect (and (pred_1 ?v4 ?v6 ?v3)
		    (not (pred_3 ?v6 ?v5)) 
		    (not (pred_2 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_1 ?v6 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v6 ?v3) (pred_4 ?v4 ?v5))
       :effect (and (pred_3 ?v6 ?v5)
		    (pred_2 ?v4 ?v3)
		    (not (pred_1 ?v4 ?v6 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_12 - type_1
obj_11 obj_06 obj_09 obj_03 - type_2
obj_08 obj_13 obj_02 obj_01 - type_3
obj_14 obj_04 obj_10 obj_05 - object)
(:init
(pred_4 obj_07 obj_13)
(pred_2 obj_07 obj_11)
(pred_2 obj_07 obj_06)
(pred_4 obj_12 obj_08)
(pred_2 obj_12 obj_09)
(pred_2 obj_12 obj_03)
(pred_3 obj_14 obj_13)
(pred_3 obj_04 obj_01)
(pred_3 obj_10 obj_01)
(pred_3 obj_05 obj_13)
)
(:goal
(and
(pred_3 obj_14 obj_02)
(pred_3 obj_04 obj_08)
(pred_3 obj_10 obj_13)
(pred_3 obj_05 obj_01)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_02)))
)
)

; plan
1. (op_2 obj_07 obj_14 obj_13 obj_06)
   deleted: (pred_3 obj_14 obj_13) (pred_2 obj_07 obj_06)
   added: (pred_1 obj_07 obj_14 obj_06)
   goals met: 0 of 4
2. (op_2 obj_07 obj_05 obj_13 obj_11)
   deleted: (pred_3 obj_05 obj_13) (pred_2 obj_07 obj_11)
   added: (pred_1 obj_07 obj_05 obj_11)
   goals met: 0 of 4
3. (op_1 obj_12 obj_08 obj_01)
   deleted: (pred_4 obj_12 obj_08)
   added: (pred_4 obj_12 obj_01)
   goals met: 0 of 4
4. (op_1 obj_07 obj_13 obj_01)
   deleted: (pred_4 obj_07 obj_13)
   added: (pred_4 obj_07 obj_01)
   goals met: 0 of 4
5. (op_2 obj_12 obj_04 obj_01 obj_03)
   deleted: (pred_3 obj_04 obj_01) (pred_2 obj_12 obj_03)
   added: (pred_1 obj_12 obj_04 obj_03)
   goals met: 0 of 4
6. (op_3 obj_07 obj_05 obj_01 obj_11)
   deleted: (pred_1 obj_07 obj_05 obj_11)
   added: (pred_3 obj_05 obj_01) (pred_2 obj_07 obj_11)
   goals met: 1 of 4
7. (op_1 obj_12 obj_01 obj_08)
   deleted: (pred_4 obj_12 obj_01)
   added: (pred_4 obj_12 obj_08)
   goals met: 1 of 4
8. (op_2 obj_07 obj_10 obj_01 obj_11)
   deleted: (pred_3 obj_10 obj_01) (pred_2 obj_07 obj_11)
   added: (pred_1 obj_07 obj_10 obj_11)
   goals met: 1 of 4
9. (op_3 obj_12 obj_04 obj_08 obj_03)
   deleted: (pred_1 obj_12 obj_04 obj_03)
   added: (pred_3 obj_04 obj_08) (pred_2 obj_12 obj_03)
   goals met: 2 of 4
10. (op_1 obj_07 obj_01 obj_13)
   deleted: (pred_4 obj_07 obj_01)
   added: (pred_4 obj_07 obj_13)
   goals met: 2 of 4
11. (op_3 obj_07 obj_10 obj_13 obj_11)
   deleted: (pred_1 obj_07 obj_10 obj_11)
   added: (pred_3 obj_10 obj_13) (pred_2 obj_07 obj_11)
   goals met: 3 of 4
12. (op_1 obj_07 obj_13 obj_08)
   deleted: (pred_4 obj_07 obj_13)
   added: (pred_4 obj_07 obj_08)
   goals met: 3 of 4
13. (op_3 obj_07 obj_14 obj_08 obj_06)
   deleted: (pred_1 obj_07 obj_14 obj_06)
   added: (pred_3 obj_14 obj_08) (pred_2 obj_07 obj_06)
   goals met: 3 of 4
14. (op_2 obj_12 obj_14 obj_08 obj_03)
   deleted: (pred_3 obj_14 obj_08) (pred_2 obj_12 obj_03)
   added: (pred_1 obj_12 obj_14 obj_03)
   goals met: 3 of 4
15. (op_1 obj_12 obj_08 obj_02)
   deleted: (pred_4 obj_12 obj_08)
   added: (pred_4 obj_12 obj_02)
   goals met: 3 of 4
16. (op_3 obj_12 obj_14 obj_02 obj_03)
   deleted: (pred_1 obj_12 obj_14 obj_03)
   added: (pred_3 obj_14 obj_02) (pred_2 obj_12 obj_03)
   goals met: 4 of 4
